<?php

declare(strict_types=1);

/**
 *  接口返回码各位置说明
 *      1位：应用标识。 0公共标识
 *      2-3位：功能模块标识。   00公共模块；01权限模块
 *      4-6位：错误码。
 */
return [
    '000000' => '成功',
    '000404' => '找不到路由',    //Not Found
    '000500' => '内部服务器错误',   //Internal Server Error.

    '001001' => '非法场景',
    '001002' => '签名方式不存在',
    '001003' => '签名失败',
    '001004' => '不支持的登录类型',

    '001400' => '您还未登录，请先登录',
    '001401' => 'token无效',
    '001402' => '账号在其他地方登录',
    '001403' => '账号不存在',
    '001404' => '您的账号已被停用',

    '001010' => '账号或密码错误',
    '001011' => '账号被停用',


    '999300' => '数据不存在',
    '999301' => '数据已存在',   //当数据库报1062重复索引，且不需要说明时使用
    '999302' => ':name已存在',   //当数据库报1062重复索引，且需要说明哪个索引时使用
    '999303' => '父级不存在',
    '999304' => '父级不能是自身',
    '999305' => '父级不能是自身的子孙级',
    '999306' => '不能删除含有子级的数据',

    '999998' => '参数错误',
    '999999' => '失败',
];
