<?php

declare(strict_types=1);

/**
 *  接口返回码各位置说明
 *      1位：错误级别。 0公共成功；9公共错误；1框架错误；2数据库错误；3业务错误；8参数错误;
 *      2位：应用标识。 0公共成功；9公共错误；
 *      3-4位：功能模块标识。   00公共成功；99公共错误；
 *      5-8位：错误码。
 */
return [
    '00000000' => '成功',
    '19990404' => '找不到路由',    //Not Found
    '19990500' => '内部服务器错误',   //Internal Server Error.

    '29991062' => '数据已存在',   //当数据库报1062重复索引，且不需要说明时使用
    '29991063' => ':name已存在',   //当数据库报1062重复索引，且需要说明哪个索引时使用
    '29999999' => '数据不存在',
    '29999998' => '父级不存在',
    '29999997' => '父级不能是自身',
    '29999996' => '父级不能是自身的子孙级',
    '29999995' => '不能删除含有子级的数据',

    '39999999' => '非法场景',
    '39999998' => '签名方式不存在',
    '39999997' => '签名失败',
    '39999996' => '不支持的登录类型',

    '39990000' => '账号或密码错误',
    '39990001' => '账号被停用',
    '39994000' => '您还未登录，请先登录',
    '39994001' => 'token无效',
    '39994002' => '账号在其他地方登录',
    '39994003' => '账号不存在',
    '39994004' => '您的账号已被停用',

    '89999999' => '参数错误',
    '99999999' => '失败',
];
